In [1]:
import pandas as pd
import numpy as np

Importing the data and getting to know it

In [2]:
df=pd.read_csv('adult.data.csv')

In [3]:
df.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [4]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

* How many people of each race are represented in this dataset? This should be a Pandas series with race names as the index labels. (race column)

In [16]:
race=df.groupby(['race']).count()
race

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
race,,,,,,,,,,,,,,
Amer-Indian-Eskimo,311,311,311,311,311,311,311,311,311,311,311,311,311,311
Asian-Pac-Islander,1039,1039,1039,1039,1039,1039,1039,1039,1039,1039,1039,1039,1039,1039
Black,3124,3124,3124,3124,3124,3124,3124,3124,3124,3124,3124,3124,3124,3124
Other,271,271,271,271,271,271,271,271,271,271,271,271,271,271
White,27816,27816,27816,27816,27816,27816,27816,27816,27816,27816,27816,27816,27816,27816

In [18]:
race_count=pd.Series(data=[27816,3124,1039,311,271],index =['White', 'Black', 'Asian-Pac-Islander', 'Amer-Indian-Eskimo', 'Other'])

In [20]:
race_count

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
dtype: int64

#### A better way to do this first task is:

In [22]:
df['race'].value_counts()

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

* What is the average age of men?

In [24]:
a=df.loc[df['sex'] == 'Male']
a['age'].mean()

39.43354749885268

#### A better way to do it ( as they also ask to round the number ):

In [23]:
round(df[df['sex'] == 'Male']['age'].mean(),1)

39.4

* What is the percentage of people who have a Bachelor's degree?

In [26]:
df_highereducation=df[(df['education']=='Bachelors')|(df['education']=='Masters')|(df['education']=='Doctorate')]
df_highereducation.count()

age               7491
workclass         7491
fnlwgt            7491
education         7491
education-num     7491
marital-status    7491
occupation        7491
relationship      7491
race              7491
sex               7491
capital-gain      7491
capital-loss      7491
hours-per-week    7491
native-country    7491
salary            7491
dtype: int64

In [27]:
df.count()

age               32561
workclass         32561
fnlwgt            32561
education         32561
education-num     32561
marital-status    32561
occupation        32561
relationship      32561
race              32561
sex               32561
capital-gain      32561
capital-loss      32561
hours-per-week    32561
native-country    32561
salary            32561
dtype: int64

In [32]:
#My solution:
7491/32561

#Then it resulted to be only Bachelor so:
(df[df['education']=='Bachelors'].count())/32561

#A much better solution:
#What is done here is to pass a condition in Pandas that returns Trues when is confirmed. Then asking for the mean
#it does the division of the True values by the Total
(df["education"] == "Bachelors").mean()

0.16446055096587942

* What percentage of people with advanced education (`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?
    
* What percentage of people without advanced education make more than 50K?

In [ ]:
df_lowereducation=df[(df['education']=='HS-grad')|(df['education']=='Some-college')|(df['education']=='Assoc-voc')|(df['education']=='11th')|(df['education']=='Assoc-acdm')|(df['education']=='10th')|(df['education']=='7th-8th')|(df['education']=='Prof-school')|(df['education']=='9th')|(df['education']=='12th')|(df['education']=='5th-6th')|(df['education']=='1st-4th')|(df['education']=='Preschool')]
df_lowereducation.count()

#### A better way of establishing this education data frames would have been:

In [ ]:
higheducation=df[df['education'].isin(['Bachelors','Masters','Doctorate'])]
loweducation=df[~df['education'].isin(['Bachelors','Masters','Doctorate'])]

### Calculating the percentaje of the higher education

In [41]:
df_highereducation[df_highereducation['salary']=='>50K'].count()

age               3486
workclass         3486
fnlwgt            3486
education         3486
education-num     3486
marital-status    3486
occupation        3486
relationship      3486
race              3486
sex               3486
capital-gain      3486
capital-loss      3486
hours-per-week    3486
native-country    3486
salary            3486
dtype: int64

In [40]:
#My solution:
3486/7491

0.46535843011613937

### Calculating the percentaje of the lower education

In [42]:
df_lowereducation=df[(df['education']=='HS-grad')|(df['education']=='Some-college')|(df['education']=='Assoc-voc')|(df['education']=='11th')|(df['education']=='Assoc-acdm')|(df['education']=='10th')|(df['education']=='7th-8th')|(df['education']=='Prof-school')|(df['education']=='9th')|(df['education']=='12th')|(df['education']=='5th-6th')|(df['education']=='1st-4th')|(df['education']=='Preschool')]
df_lowereducation.count()

age               25070
workclass         25070
fnlwgt            25070
education         25070
education-num     25070
marital-status    25070
occupation        25070
relationship      25070
race              25070
sex               25070
capital-gain      25070
capital-loss      25070
hours-per-week    25070
native-country    25070
salary            25070
dtype: int64

In [43]:
df_lowereducation[df_lowereducation['salary']=='>50K'].count()

age               4355
workclass         4355
fnlwgt            4355
education         4355
education-num     4355
marital-status    4355
occupation        4355
relationship      4355
race              4355
sex               4355
capital-gain      4355
capital-loss      4355
hours-per-week    4355
native-country    4355
salary            4355
dtype: int64

In [44]:
#My solution
4355/25070

0.173713601914639

* What is the minimum number of hours a person works per week (hours-per-week feature)?

In [48]:
df['hours-per-week'].min()

1

 * What percentage of the people who work the minimum number of hours per week have a salary of >50K?

In [45]:
onehour=df.loc[df['hours-per-week']==1]
onehour.count()

age               20
workclass         20
fnlwgt            20
education         20
education-num     20
marital-status    20
occupation        20
relationship      20
race              20
sex               20
capital-gain      20
capital-loss      20
hours-per-week    20
native-country    20
salary            20
dtype: int64

In [46]:
onehour.loc[onehour['salary']=='>50K'].count()

age               2
workclass         2
fnlwgt            2
education         2
education-num     2
marital-status    2
occupation        2
relationship      2
race              2
sex               2
capital-gain      2
capital-loss      2
hours-per-week    2
native-country    2
salary            2
dtype: int64

In [52]:
#Solution 
2/20

20

* What country has the highest percentage of people that earn >50K?

In [5]:
highsalary=df[df['salary']=='>50K']

In [6]:
division_bycountry=df.groupby(['native-country']).count()

In [60]:
percentages=highsalary.groupby(['native-country']).count()/division_bycountry
#To know that Iran is the country that we get as a result
percentages.idxmax()

age               Iran
workclass         Iran
fnlwgt            Iran
education         Iran
education-num     Iran
marital-status    Iran
occupation        Iran
relationship      Iran
race              Iran
sex               Iran
capital-gain      Iran
capital-loss      Iran
hours-per-week    Iran
salary            Iran
dtype: object

In [61]:
#To know the percentage of high salary peope in Iran
percentages.max()

age               0.418605
workclass         0.418605
fnlwgt            0.418605
education         0.418605
education-num     0.418605
marital-status    0.418605
occupation        0.418605
relationship      0.418605
race              0.418605
sex               0.418605
capital-gain      0.418605
capital-loss      0.418605
hours-per-week    0.418605
salary            0.418605
dtype: float64

In [53]:
df['occupation'].value_counts()

Prof-specialty       4140
Craft-repair         4099
Exec-managerial      4066
Adm-clerical         3770
Sales                3650
Other-service        3295
Machine-op-inspct    2002
?                    1843
Transport-moving     1597
Handlers-cleaners    1370
Farming-fishing       994
Tech-support          928
Protective-serv       649
Priv-house-serv       149
Armed-Forces            9
Name: occupation, dtype: int64

In [54]:
highsalary.loc[highsalary['native-country']=='India'].groupby(['occupation']).count()

,age,workclass,fnlwgt,education,education-num,marital-status,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
occupation,,,,,,,,,,,,,,
Adm-clerical,1,1,1,1,1,1,1,1,1,1,1,1,1,1
Exec-managerial,8,8,8,8,8,8,8,8,8,8,8,8,8,8
Other-service,2,2,2,2,2,2,2,2,2,2,2,2,2,2
Prof-specialty,25,25,25,25,25,25,25,25,25,25,25,25,25,25
Sales,1,1,1,1,1,1,1,1,1,1,1,1,1,1
Tech-support,2,2,2,2,2,2,2,2,2,2,2,2,2,2
Transport-moving,1,1,1,1,1,1,1,1,1,1,1,1,1,1

In [57]:
#Answer looking at table
25

25

## Another way of finding the most common job in India:

In [12]:
df[(df['native-country']=='India') & (df['salary']=='>50K')]['occupation'].value_counts().idxmax()

'Prof-specialty'